# Brewfile - Declarative System Environment Setup
# Highly optimized for modern CLI, Development, and System Utilities.

# Ensure Homebrew Bundle tap is active
tap "homebrew/bundle"

# ==============================================================================
# CORE DEVELOPMENT TOOLS & COMPILERS
# ==============================================================================
brew "git"                     # Distributed version control system
brew "git-lfs"                 # Git extension for versioning large files

# ==============================================================================
# ENVIRONMENT & RUNTIME MANAGERS
# ==============================================================================
brew "mise"                    # Polyglot tool manager (Node, Go, Python runtime manager)
brew "starship"                # The minimal, blazing-fast, and customizable prompt
brew "tmux"                    # Terminal multiplexer for managing multiple sessions
brew "zoxide"                  # A smarter cd command that learns your habits

# ==============================================================================
# ZSH UTILITIES & AUTOCOMPLETIONS
# ==============================================================================
brew "zsh"                     # Programmable command interpreter (Shell)
brew "zsh-autocomplete"        # Real-time type-ahead completion for Zsh
brew "zsh-autopair"            # Auto-close brackets and quotes for Zsh
brew "zsh-autosuggestions"     # Fish-like fast, unobtrusive suggestions for Zsh
brew "zsh-completions"         # Additional completion definitions for Zsh
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for Zsh

# ==============================================================================
# MODERN CLI REPLACEMENTS (RUST-POWERED & SPEED)
# ==============================================================================
brew "atuin"                   # Magical shell history sync and search daemon
brew "bat"                     # A cat(1) clone with syntax highlighting and Git integration
brew "btop"                    # Resource monitor that shows usage and stats of processor, memory, disks
brew "eza"                     # A modern, maintained replacement for ls
brew "fd"                      # A simple, fast and user-friendly alternative to 'find'
brew "fzf"                     # A command-line fuzzy finder
brew "ripgrep"                 # A line-oriented search tool that recursively searches directories (rg)
brew "tealdeer"                # A very fast implementation of tldr in Rust

# ==============================================================================
# FILE, MEDIA & NETWORK UTILITIES
# ==============================================================================
brew "exiftool"                # Perl library and application for reading and writing meta information
brew "mpv"                     # Video player on terminal
brew "yt-dlp"                  # YouTube curl
brew "imagemagick"             # Software suite to create, edit, compose, or convert bitmap images
brew "zstd"                    # Fast real-time compression algorithm developed by Meta

# ==============================================================================
# VIRTUALIZATION, GRAPHICS & AI
# ==============================================================================
brew "colima"                  # Container runtimes on macOS (Docker alternative) with minimal setup
brew "ollama"                  # Lightweight framework to run large language models locally
brew "molten-vk"               # Vulkan implementation on top of Apple's Metal framework

# ==============================================================================
# APP EDITORS, SECURITY & MISC
# ==============================================================================
brew "gnupg"                   # GNU Privacy Guard (OpenPGP) cryptography suite
brew "pass"                    # The standard unix password manager
brew "neovim"                  # Vim-fork focused on extensibility and usability
brew "pinentry-mac"            # Passphrase entry dialog for GPG on macOS

# Custom / Third-party formulae (Will search brew-core or taps)
brew "herdr"                   # Lightweight process management/automation helper